apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_rspi_sw.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include <arch/board/board.h>

#include "renesas_internal.h"
#include "chip.h"
#include "rx65n_definitions.h"
#include "rx65n_rspi.h"

#include <arch/board/board.h>
#include <arch/board/rx65n_gpio.h>

#if defined(CONFIG_RX65N_RSPI0) || defined(CONFIG_RX65N_RSPI1) || defined(CONFIG_RX65N_RSPI2)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Default bit rate */

#define RSPI_BRDV_DEFAULT 0

/* The number of words that will fit in the Tx FIFO */

#define RX65N_TXFIFO_WORDS BUFSIZE_4FRAME

/* Interrupt priority */

#define RX65N_RSPI_INTRRUPT_PRIO 15

/* RSPI power on and off */

#define RSPI_POWER_ON 0
#define RSPI_POWER_OFF 1

/* RSPI Register protection enable and disable */

#define REG_PROTECTION_ON 1
#define REG_PROTECTION_OFF 0

/* Frequency divisor */

enum FREQ_DIVISOR
{
  FREQ_DIVISOR_2 = 2,
  FREQ_DIVISOR_4 = 4,
  FREQ_DIVISOR_6 = 6,
  FREQ_DIVISOR_8 = 8,
  FREQ_DIVISOR_10 = 10,
  FREQ_DIVISOR_12 = 12,
  FREQ_DIVISOR_24 = 24,
  FREQ_DIVISOR_48 = 48,
  FREQ_DIVISOR_96 = 96,
};

/* The number of words that will fit in the buffer */

enum BUF_SIZE
{
  BUFSIZE_1FRAME = 1,
  BUFSIZE_2FRAME = 2,
  BUFSIZE_3FRAME = 3,
  BUFSIZE_4FRAME = 4,
};

/* RSPI events */

typedef enum
{
  RSPI_EVT_TRANSFER_COMPLETE, /* The data transfer completed */
  RSPI_EVT_TRANSFER_ABORTED,  /* The data transfer was aborted */
  RSPI_EVT_ERR_MODE_FAULT,    /* Mode fault error */
  RSPI_EVT_ERR_READ_OVF,      /* Read overflow */
  RSPI_EVT_ERR_PARITY,        /* Parity error */
  RSPI_EVT_ERR_UNDER_RUN,     /* Under run error */
  RSPI_EVT_ERR_UNDEF          /* Undefined/unknown error event */
} rspi_event_t;

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct rx65n_rspidev_s
{
  struct spi_dev_s  rspidev;  /* Externally visible part of the RSPI interface */
  uint32_t  rspibase;         /* RSPIn base address */
  uint32_t  rspiclock;        /* Clocking for the RSPI module */

#ifndef CONFIG_SPI_POLLWAIT
  uint8_t rspitxirq;  /* RSPI tx IRQ number */
  uint8_t rspirxirq;  /* RSPI rx IRQ number */
  uint8_t rspierirq;  /* RSPI error IRQ number */
  uint8_t rspiidlirq; /* RSPI idle IRQ number */
  uint32_t rspigrpbase;
  uint32_t rspierimask;
  uint32_t rspiidlimask;
  sem_t waitsem;      /* Wait for transfer to complete */
#endif

  /* These following are the source and destination buffers of the transfer.
   * they are retained in this structure so that they will be accessible
   * from an interrupt handler.  The actual type of the buffer is uint8_t is
   * nbits <=8 and uint16_t is nbits >8.
   */

  void *txbuffer;              /* Source buffer */
  void *rxbuffer;              /* Destination buffer */

  /* These are functions pointers that are configured to perform the
   * appropriate transfer for the particular kind of exchange that is
   * occurring.  Different functions may be selected depending on (1)
   * if the tx or txbuffer is NULL and depending on the number of bits
   * per word.
   */

  void (*txword)(struct rx65n_rspidev_s *priv);
  void (*rxword)(struct rx65n_rspidev_s *priv);

  bool initialized;   /* Has RSPI interface been initialized */
  mutex_t lock;       /* Held while chip is selected for mutual exclusion */
  uint32_t frequency; /* Requested clock frequency */
  uint32_t actual;    /* Actual clock frequency */

  int ntxwords;       /* Number of words left to transfer on the Tx Buffer */
  int nrxwords;       /* Number of words received on the Rx Buffer */
  int nwords;         /* Number of words to be exchanged */

  uint8_t nbits;      /* Width of word in bits (4 through 16) */
  uint8_t mode;       /* Mode 0,1,2,3 */
  uint8_t bufsize;    /* Buf size: 1,2,3 or 4 word */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Helpers */

static inline uint32_t rspi_getreg32(struct rx65n_rspidev_s *priv,
                                     uint8_t offset);
static inline uint16_t rspi_getreg16(struct rx65n_rspidev_s *priv,
                                     uint8_t offset);
static inline uint8_t rspi_getreg8(struct rx65n_rspidev_s *priv,
                                   uint8_t offset);
static inline void rspi_putreg32(struct rx65n_rspidev_s *priv,
                                 uint8_t offset, uint32_t value);
static inline void rspi_putreg16(struct rx65n_rspidev_s *priv,
                                 uint8_t offset, uint16_t value);
static inline void rspi_putreg8(struct rx65n_rspidev_s *priv,
                                uint8_t offset, uint8_t value);

/* SPI data transfer */

static void rspi_txnull(struct rx65n_rspidev_s *priv);
static void rspi_txuint32(struct rx65n_rspidev_s *priv);
static void rspi_txuint16(struct rx65n_rspidev_s *priv);
static void rspi_txuint8(struct rx65n_rspidev_s *priv);
static void rspi_rxnull(struct rx65n_rspidev_s *priv);
static void rspi_rxuint32(struct rx65n_rspidev_s *priv);
static void rspi_rxuint16(struct rx65n_rspidev_s *priv);
static void rspi_rxuint8(struct rx65n_rspidev_s *priv);
static void rspi_performtx(struct rx65n_rspidev_s *priv);
static inline void rspi_performrx(struct rx65n_rspidev_s *priv);
static int rspi_transfer(struct rx65n_rspidev_s *priv, const void *txbuffer,
                         void *rxbuffer, unsigned int nwords);

/* Interrupt handling */

#ifndef CONFIG_SPI_POLLWAIT
static inline struct rx65n_rspidev_s *rspi_mapirq(int irq);
static int rspi_idlinterrupt(int irq, void *context, void *arg);
static int rspi_erinterrupt(int irq, void *context, void *arg);
static int rspi_txinterrupt(int irq, void *context, void *arg);
static int rspi_rxinterrupt(int irq, void *context, void *arg);
#endif

/* SPI methods */

