apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
uint8_t rx65n_rspi0status(struct spi_dev_s *dev, uint32_t devid)
{
  return 0;
}

int rx65n_rspi0cmddata(struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  return -ENODEV;
}
#endif

#ifdef CONFIG_RX65N_RSPI1
void rx65n_rspi1select(struct spi_dev_s *dev, uint32_t devid,
                       bool selected)
{
  spiinfo("devid: %d CS: %s\n", (int)devid, selected ? "assert" :
                                                         "de-assert");
}

uint8_t rx65n_rspi1status(struct spi_dev_s *dev, uint32_t devid)
{
  return 0;
}

int rx65n_rspi1cmddata(struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  return -ENODEV;
}
#endif

#ifdef CONFIG_RX65N_RSPI2
void rx65n_rspi2select(struct spi_dev_s *dev, uint32_t devid,
                       bool selected)
{
  spiinfo("devid: %d CS: %s\n", (int)devid, selected ? "assert" :
                                                          "de-assert");
}

uint8_t rx65n_rspi2status(struct spi_dev_s *dev, uint32_t devid)
{
  return 0;
}

int rx65n_rspi2cmddata(struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  return -ENODEV;
}
#endif

/****************************************************************************
 * Name: rx65n_rspi0/1/2register
 *
 * Description:
 * If the board supports a card detect callback to inform the SPI-based
 * MMC/SD driver when an SD card is inserted or removed, then
 * CONFIG_SPI_CALLBACK should be defined and the following function(s)
 * must be implemented. These functions implements the registercallback
 * method of the SPI interface (see include/nuttx/spi/spi.h for details)
 *
 * Input Parameters:
 *   dev -      Device-specific state data
 *   callback - The function to call on the media change
 *   arg -      A caller provided value to return with the callback
 *
 * Returned Value:
 *   0 on success; negated errno on failure.
 *
 ****************************************************************************/
#ifdef CONFIG_SPI_CALLBACK
#ifdef CONFIG_RX65N_RSPI0
int rx65n_rspi0register(struct spi_dev_s *dev, spi_mediachange_t callback,
                        void *arg)
{
  spiinfo("INFO: Registering rspi0 device\n");
  return OK;
}
#endif

#ifdef CONFIG_RX65N_RSPI1
int rx65n_rspi1register(struct spi_dev_s *dev, spi_mediachange_t callback,
                        void *arg)
{
  spiinfo("INFO: Registering rspi1 device\n");
  return OK;
}
#endif

#ifdef CONFIG_RX65N_RSPI2
int rx65n_rspi2register(struct spi_dev_s *dev, spi_mediachange_t callback,
                        void *arg)
{
  spiinfo("INFO: Registering rspi2 device\n");
  return OK;
}
#endif
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rspi_getreg32
 *
 * Description:
 *   Read the RSPI register at this offeset
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   offset - Offset to the SPI register from the register base address
 *
 * Returned Value:
 *   Value of the register at this offset
 *
 ****************************************************************************/

static inline uint32_t rspi_getreg32(struct rx65n_rspidev_s *priv,
                                     uint8_t offset)
{
  return getreg32(priv->rspibase + offset);
}

/****************************************************************************
 * Name: rspi_getreg16
 *
 * Description:
 *   Read the RSPI register at this offeset
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   offset - Offset to the SPI register from the register base address
 *
 * Returned Value:
 *   Value of the register at this offset
 *
 ****************************************************************************/

static inline uint16_t rspi_getreg16(struct rx65n_rspidev_s *priv,
                                     uint8_t offset)
{
  return getreg16(priv->rspibase + offset);
}

/****************************************************************************
 * Name: rspi_getreg8
 *
 * Description:
 *   Read the RSPI register at this offeset
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   offset - Offset to the SPI register from the register base address
 *
 * Returned Value:
 *   Value of the register at this offset
 *
 ****************************************************************************/

static inline uint8_t rspi_getreg8(struct rx65n_rspidev_s *priv,
                                   uint8_t offset)
{
  return getreg8(priv->rspibase + offset);
}

/****************************************************************************
 * Name: rspi_putreg32
 *
 * Description:
 *   Write the value to the RSPI register at this offeset
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   offset - Offset to the SPI register from the register base address
 *   value  - Value to write
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void rspi_putreg32(struct rx65n_rspidev_s *priv,
                                 uint8_t offset, uint32_t value)
{
  putreg32(value, priv->rspibase + offset);
}

/****************************************************************************
 * Name: rspi_putreg16
 *
 * Description:
 *   Write the value to the RSPI register at this offeset
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   offset - Offset to the SPI register from the register base address
 *   value  - Value to write
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void rspi_putreg16(struct rx65n_rspidev_s *priv,
                                 uint8_t offset, uint16_t value)
{
  putreg16(value, priv->rspibase + offset);
}

/****************************************************************************
 * Name: rspi_putreg8
 *
 * Description:
 *   Write the value to the RSPI register at this offeset
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   offset - Offset to the SPI register from the register base address
 *   value  - Value to write
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void rspi_putreg8(struct rx65n_rspidev_s *priv,
                                uint8_t offset, uint8_t value)
{
  putreg8(value, priv->rspibase + offset);
}

/****************************************************************************
 * Name: rspi_txnull, rspi_txuint16, and rspi_txuint8
 *
 * Description:
 *   Transfer all ones, a uint8_t, or uint16_t to Tx FIFO and update
 *   the txbuffer pointer appropriately.  The selected function depends
 *   on (1) if there is a source txbuffer provided, and (2) if the
 *   number of bits per word is <=8 or >8.
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_txnull(struct rx65n_rspidev_s *priv)
{
  rspi_putreg32(priv, RX65N_RSPI_SPDR_OFFSET, 0xffff);
}

static void rspi_txuint32(struct rx65n_rspidev_s *priv)
{
  uint32_t *ptr = (uint32_t *)priv->txbuffer;
  rspi_putreg32(priv, RX65N_RSPI_SPDR_OFFSET, *ptr++);
  priv->txbuffer = (void *)ptr;
}

static void rspi_txuint16(struct rx65n_rspidev_s *priv)
{
  uint16_t *ptr = (uint16_t *)priv->txbuffer;
  rspi_putreg16(priv, RX65N_RSPI_SPDR_OFFSET, *ptr++);
  priv->txbuffer = (void *)ptr;
}

static void rspi_txuint8(struct rx65n_rspidev_s *priv)
{
  uint8_t *ptr = (uint8_t *)priv->txbuffer;
  rspi_putreg8(priv, RX65N_RSPI_SPDR_OFFSET, *ptr++);
  priv->txbuffer = (void *)ptr;
}

/****************************************************************************
 * Name: rspi_rxnull,rspi_rxuint16, and rspi_rxuint8
 *
 * Description:
 *   Discard input, save a uint8_t, or or save a uint16_t from Tx FIFO in the
 *   user rxvbuffer and update the rxbuffer pointer appropriately.  The
 *   selected function dependes on (1) if there is a destination rxbuffer
 *   provided, and (2) if the number of bits per word is <=8 or >8.
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_rxnull(struct rx65n_rspidev_s *priv)
{
  rspi_getreg32(priv, RX65N_RSPI_SPDR_OFFSET);
}

