apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
static void rspi_rxuint32(struct rx65n_rspidev_s *priv)
{
  uint32_t *ptr = (uint32_t *)priv->rxbuffer;
  *ptr++ = (uint32_t)rspi_getreg32(priv, RX65N_RSPI_SPDR_OFFSET);
  priv->rxbuffer = (void *)ptr;
}

static void rspi_rxuint16(struct rx65n_rspidev_s *priv)
{
  uint16_t *ptr = (uint16_t *)priv->rxbuffer;
  *ptr++ = (uint16_t)rspi_getreg16(priv, RX65N_RSPI_SPDR_OFFSET);
  priv->rxbuffer = (void *)ptr;
}

static void rspi_rxuint8(struct rx65n_rspidev_s *priv)
{
  uint8_t *ptr = (uint8_t *)priv->rxbuffer;
  *ptr++ = (uint8_t)rspi_getreg8(priv, RX65N_RSPI_SPDR_OFFSET);
  priv->rxbuffer = (void *)ptr;
}

/****************************************************************************
 * Name: rspi_performtx
 *
 * Description:
 *   If the Tx FIFO is empty, then transfer as many words as we can to
 *   the FIFO.
 *
 * Input Parameters:
 *
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_performtx(struct rx65n_rspidev_s *priv)
{
  uint8_t regval8;
  int ntxd = 0;  /* Number of words written to Tx FIFO */

  /* Check if the Tx FIFO is empty */

  if ((rspi_getreg8(priv, RX65N_RSPI_SPSR_OFFSET) & RSPI_SPSR_SPTEF) != 0)
    {
      /* Check if all of the Tx words have been sent */

      if (priv->ntxwords > 0)
        {
          /* No..
           * Transfer more words until either the TxFIFO is full or
           * until all of the user provided data has been sent.
           */

          for (; ntxd < priv->ntxwords && ntxd < priv->bufsize; ntxd++)
            {
              priv->txword(priv);
            }

          /* Update the count of words to be transferred */

          priv->ntxwords -= ntxd;

          /* Add dummy data in FIFO to make it full */

          if (ntxd < priv->bufsize)
            {
              while (ntxd != priv->bufsize)
                {
                  rspi_txnull(priv);
                  ntxd++;
                }
            }
        }
      else
        {
          /* Yes.. The transfer is complete,
           * disable Tx FIFO empty interrupt
           */

          regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
          regval8 &= ~RSPI_SPCR_SPTIE;
          rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);
        }
    }
}

/****************************************************************************
 * Name: rspi_performrx
 *
 * Description:
 *   Transfer as many bytes as possible from the Rx FIFO to the user Rx
 *   buffer (if one was provided).
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void rspi_performrx(struct rx65n_rspidev_s *priv)
{
  /* Loop while data is available in the Rx FIFO (SPRXn) */

  while ((rspi_getreg8(priv, RX65N_RSPI_SPSR_OFFSET) & RSPI_SPSR_SPRF) != 0)
    {
      /* Have all of the requested words been transferred from the Rx FIFO? */

      if (priv->nrxwords < priv->nwords)
        {
          /* No.. Read more data from Rx FIFO */

          priv->rxword(priv);
          priv->nrxwords++;
        }
      else
        {
          rspi_rxnull(priv); /* Reading dummy data send */
        }
    }
}

/****************************************************************************
 * Name: rspi_startxfr
 *
 * Description:
 *   If data was added to the Tx FIFO, then start the exchange
 *
 * Input Parameters:
 *   priv  - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_startxfr(struct rx65n_rspidev_s *priv)
{
  uint8_t regval8;

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 |= RSPI_SPCR_SPE;
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);
}

/****************************************************************************
 * Name: rspi_transfer
 *
 * Description:
 *   Exchange a block data with the SPI device
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   txbuffer - The buffer of data to send to the device (may be NULL).
 *   rxbuffer - The buffer to receive data from the device (may be NULL).
 *   nwords   - The total number of words to be exchanged.  If the interface
 *              uses <= 8 bits per word, then this is the number of
 *              uint8_t's; if the interface uses >8 bits per word, then this
 *              is the number of uint16_t's
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

static int rspi_transfer(struct rx65n_rspidev_s *priv, const void *txbuffer,
                         void *rxbuffer, unsigned int nwords)
{
  uint8_t regval8;
#ifndef CONFIG_SPI_POLLWAIT
  irqstate_t flags;
#endif

  /* Set up to perform the transfer */

  priv->txbuffer = (uint8_t *)txbuffer; /* Source buffer */
  priv->rxbuffer = (uint8_t *)rxbuffer; /* Destination buffer */
  priv->ntxwords = nwords;              /* Number of words left to send */
  priv->nrxwords = 0;                   /* Number of words received */
  priv->nwords = nwords;                /* Total number of exchanges */

  /* Set up the low-level data transfer function pointers */

  if (priv->nbits > 16)
    {
      priv->txword = rspi_txuint32;
      priv->rxword = rspi_rxuint32;
    }

  if (priv->nbits > 8)
    {
      priv->txword = rspi_txuint16;
      priv->rxword = rspi_rxuint16;
    }
  else
    {
      priv->txword = rspi_txuint8;
      priv->rxword = rspi_rxuint8;
    }

  if (!txbuffer)
    {
      priv->txword = rspi_txnull;
    }

  if (!rxbuffer)
    {
      priv->rxword = rspi_rxnull;
    }

  /* Copied data to start the sequence (saves one interrupt) */

#ifndef CONFIG_SPI_POLLWAIT
  flags = enter_critical_section();

  /* Enable interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 |= (RSPI_SPCR_SPEIE | RSPI_SPCR_SPTIE | RSPI_SPCR_SPRIE);
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Start transmission */

  rspi_performtx(priv);
  rspi_startxfr(priv);

  /* Enable Idle interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR2_OFFSET);
  regval8 |= (RSPI_SPCR2_SPIIE); /* RSPI Idle Interrupt Enable */
  rspi_putreg8(priv, RX65N_RSPI_SPCR2_OFFSET, regval8);

  leave_critical_section(flags);

  /* Wait for the transfer to complete.  Since there is no handshake
   * with SPI, the following should complete even if there are problems
   * with the transfer, so it should be safe with no timeout.
   */

  /* Wait to be signaled from the interrupt handler */

