apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
  return nxsem_wait_uninterruptible(&priv->waitsem);

#else
  /* Perform the transfer using polling logic.  This will totally
   * dominate the CPU until the transfer is complete.  Only recommended
   * if (1) your SPI is very fast, and (2) if you only use very short
   * transfers.
   */

  do
    {
      /* Handle outgoing Tx FIFO transfers */

      rspi_performtx(priv);

      /* Handle incoming Rx FIFO transfers */

      rspi_performrx(priv);

      /* Resume the transfer */

      rspi_startxfr(priv);

      /* If there are other threads at this same priority level,
       * the following may help:
       */

      sched_yield();
    }
  while (priv->nrxwords < priv->nwords);

  return OK;
#endif
}

/****************************************************************************
 * Name: rspi_mapirq
 *
 * Description:
 *   Map an IRQ number into the appropriate SPI device
 *
 * Input Parameters:
 *   irq   - The IRQ number to be mapped
 *
 * Returned Value:
 *   On success, a reference to the private data structgure for this IRQ.
 *   NULL on failure.
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_POLLWAIT
static inline struct rx65n_rspidev_s *rspi_mapirq(int irq)
{
  switch (irq)
    {
#ifdef CONFIG_RX65N_RSPI0
      case RX65N_SPRI0_IRQ:
      case RX65N_SPTI0_IRQ:
      case RX65N_SPEI0_IRQ:
      case RX65N_SPII0_IRQ:
        return &g_rspi0dev;
#endif
#ifdef CONFIG_RX65N_RSPI1
      case RX65N_SPRI1_IRQ:
      case RX65N_SPTI1_IRQ:
      case RX65N_SPEI1_IRQ:
      case RX65N_SPII1_IRQ:
        return &g_rspi1dev;
#endif
#ifdef CONFIG_RX65N_RSPI2
      case RX65N_SPRI2_IRQ:
      case RX65N_SPTI2_IRQ:
      case RX65N_SPEI2_IRQ:
      case RX65N_SPII2_IRQ:
        return &g_rspi2dev;
#endif
      default:
        return NULL;
    }
}
#endif

/****************************************************************************
 * Name: rspi_errhandle
 *
 * Description:
 *  RSPI common error handler
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   bus   - channel number
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_POLLWAIT
static void rspi_errhandle(struct rx65n_rspidev_s *priv, uint8_t bus)
{
  uint8_t regval8;

  rspi_event_t event = RSPI_EVT_ERR_UNDEF;

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPSR_OFFSET);

  /* Identify and clear error condition . */

  if (regval8 & RSPI_SPSR_OVRF)
    {
      /* Overrun error */

      if (RSPI_EVT_ERR_UNDEF == event)
        {
          event = RSPI_EVT_ERR_READ_OVF;
        }

      /* Clear error source: OVRF flag. */

      regval8 &= (~RSPI_SPSR_OVRF);
      rspi_putreg8(priv, RX65N_RSPI_SPSR_OFFSET, regval8);
    }

  if (regval8 & RSPI_SPSR_MODF)
    {
      if (regval8 & RSPI_SPSR_UDRF)
        {
          if (RSPI_EVT_ERR_UNDEF == event)
            {
                event = RSPI_EVT_ERR_UNDER_RUN;
            }

          /* Clear error source : MODF flag and UDRF */

          regval8 &= RSPI_SPSR_MODF_UDRF_MASK;
          rspi_putreg8(priv, RX65N_RSPI_SPSR_OFFSET, regval8);
        }
      else
        {
          if (RSPI_EVT_ERR_UNDEF == event)
            {
                event = RSPI_EVT_ERR_MODE_FAULT;
            }

          /* Clear error source : MODF flag */

          regval8 &= (~RSPI_SPSR_MODF);
          rspi_putreg8(priv, RX65N_RSPI_SPSR_OFFSET, regval8);
        }
    }

  if (regval8 & RSPI_SPSR_PERF)
    {
      if (RSPI_EVT_ERR_UNDEF == event)
        {
           event = RSPI_EVT_ERR_PARITY;
        }

      /* Clear error source: PERF flag */

      regval8 &= (~RSPI_SPSR_PERF);
      rspi_putreg8(priv, RX65N_RSPI_SPSR_OFFSET, regval8);
    }

  /* Disable the RSPI operation . */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 &= (~(RSPI_SPCR_SPTIE | RSPI_SPCR_SPRIE | RSPI_SPCR_SPE));
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Yes, wake up the waiting thread . */

  nxsem_post(&priv->waitsem);
}
#endif

/****************************************************************************
 * Name: rspi_idlinterrupt
 *
 * Description:
 *  RSPI IDLE interrupt handler invoke on transmission/reception completion
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_POLLWAIT
static int rspi_idlinterrupt(int irq, void *context, void *arg)
{
  uint8_t regval8;

  struct rx65n_rspidev_s *priv = rspi_mapirq(irq);

  DEBUGASSERT(priv != NULL);

  /* Disable Idle interrupt in SPCR2 */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR2_OFFSET);
  regval8 &= ~(RSPI_SPCR2_SPIIE); /* RSPI Idle Interrupt Enable */
  rspi_putreg8(priv, RX65N_RSPI_SPCR2_OFFSET, regval8);

  /* Disable ransmit/receive interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 &= ~(RSPI_SPCR_SPRIE | RSPI_SPCR_SPTIE);
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Yes, wake up the waiting thread */

  nxsem_post(&priv->waitsem);

  return OK;
}
#endif

/****************************************************************************
 * Name: rspi_erinterrupt
 *
 * Description:
 *   RSPI common error interrupt handler
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_POLLWAIT
static int rspi_erinterrupt(int irq, void *context, void *arg)
{
  struct rx65n_rspidev_s *priv = rspi_mapirq(irq);

  DEBUGASSERT(priv != NULL);

#ifdef CONFIG_RX65N_RSPI0
  rspi_errhandle(priv, RX65N_RSPI_CHANNEL0);
#endif

#ifdef CONFIG_RX65N_RSPI1
  rspi_errhandle(priv, RX65N_RSPI_CHANNEL1);
#endif

#ifdef CONFIG_RX65N_RSPI2
  rspi_errhandle(priv, RX65N_RSPI_CHANNEL2);
#endif

  return OK;
}
#endif

/****************************************************************************
 * Name: rspi_rxinterrupt
 *
 * Description:
 *   Receive buffer full interrupt handler to process a block data from SPI
 *   device
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   rxbuffer - The buffer to receive data from the device (may be NULL).
 *   nwords   - The total number of words to be exchanged.  If the interface
 *              uses <= 8 bits per word, then this is the number of
 *              uint8_t's; if the interface uses >8 bits per word, then this
 *              is the number of uint16_t's
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_POLLWAIT
static int rspi_rxinterrupt(int irq, void *context, void *arg)
{
  struct rx65n_rspidev_s *priv = rspi_mapirq(irq);

  DEBUGASSERT(priv != NULL);

  /* Handle incoming Rx FIFO transfers */

