apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
      /* Configure command data register for this transfer */

      regval16 = rspi_getreg16(priv, RX65N_RSPI_SPCMD0_OFFSET);
      regval16 |= (RSPI_SPCMD_SPB_MASK & ((nbits - 1) << 8));
      rspi_putreg16(priv, RX65N_RSPI_SPCMD0_OFFSET, regval16);

      priv->nbits   = nbits;
    }
  else
    {
      spiwarn("Warning: Unsupported RSPI Word width: %d\n", nbits);
    }
}

/****************************************************************************
 * Name: rspi_send
 *
 * Description:
 *   Exchange one word on RSPI
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send.  the size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   response
 *
 ****************************************************************************/

static uint32_t rspi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  uint32_t response = 0;

  rspi_transfer(priv, &wd, &response, 1);
  return response;
}

/****************************************************************************
 * Name: rspi_exchange
 *
 * Description:
 *   Exahange a block of data from SPI. Required.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   buffer   - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_EXCHANGE
static void rspi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                          void *rxbuffer, size_t nwords)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  rspi_transfer(priv, txbuffer, rxbuffer, nwords);
}
#endif

/****************************************************************************
 * Name: rspi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer of data to be sent
 *   nwords - the length of data to send from the buffer in number of words.
 *            The wordsize is determined by the number of bits-per-word
 *            selected for the SPI interface.  If nbits <= 8, the data is
 *            packed into uint8_t's; if nbits >8, the data is packed into
 *            uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void rspi_sndblock(struct spi_dev_s *dev, const void *buffer,
                          size_t nwords)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  rspi_transfer(priv, buffer, NULL, nwords);
}
#endif

/****************************************************************************
 * Name: rspi_recvblock
 *
 * Description:
 *   Revice a block of data from SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer in which to receive data
 *   nwords - the length of data that can be received in the buffer in number
 *            of words.  The wordsize is determined by the number of
 *            bits-per-word selected for the SPI interface.  If nbits <= 8,
 *            the data is packed into uint8_t's; if nbits >8, the data is
 *            packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void rspi_recvblock(struct spi_dev_s *dev, void *buffer,
                           size_t nwords)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  rspi_transfer(priv, NULL, buffer, nwords);
}
#endif

/****************************************************************************
 * Function Name: rspi_interrupt_init
 * Description  : Configure ICU for RSPI interrupt
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

void rspi_interrupt_init(struct rx65n_rspidev_s *priv, uint8_t bus)
{
  /* Enable error interrupt source bit */

  IEN(ICU, GROUPAL0) = 0;  /* Disable Group AL0 interrupts */
  IR(ICU, GROUPAL0)  = 0;  /* Clear interrupt flag */
  IPR(ICU, GROUPAL0) = RX65N_RSPI_INTRRUPT_PRIO;
  IEN(ICU, GROUPAL0) = 1;  /* Enable Group AL0 interrupt */

#ifdef CONFIG_RX65N_RSPI0
  if (bus == RX65N_RSPI_CHANNEL0)
    {
      /* Configure Transmit empty buffer interrupt source bit */

      IEN(RSPI0, SPTI0) = 0;  /* Disable SPTI0 interrupts */
      IR(RSPI0, SPTI0)  = 0;  /* Clear interrupt flag */
      IPR(RSPI0, SPTI0) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI0, SPTI0) = 1;  /* Enable SPTI0 interrupt */
      ICU.IER[0x04].BIT.IEN7 = 1;

      /* Configure Receive buffer full interrupt source bit */

      IEN(RSPI0, SPRI0) = 0; /* Disable SPRI0 interrupts */
      IR(RSPI0, SPRI0) = 0;  /* Clear interrupt flag */
      IPR(RSPI0, SPRI0) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI0, SPRI0) = 1; /* Enable SPRI0 interrupt */
      ICU.IER[0x04].BIT.IEN6 = 1;

      /* Enable error interrupt source bit */

      ICU.GENAL0.BIT.EN17 = 1;

      /* Enable Idle interrupt source bit */

      ICU.GENAL0.BIT.EN16 = 1;
    }
#endif

#ifdef CONFIG_RX65N_RSPI1
  if (bus == RX65N_RSPI_CHANNEL1)
    {
      /* Configure Transmit empty buffer interrupt */

      IEN(RSPI1, SPTI1) = 0;  /* Disable SPTI1 interrupts */
      IR(RSPI1, SPTI1)  = 0;  /* Clear interrupt flag */
      IPR(RSPI1, SPTI1) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI1, SPTI1) = 1;  /* Enable SPTI1 interrupt */
      ICU.IER[0x05].BIT.IEN1 = 1;

      /* Configure Receive buffer full interrupt */

