apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
      IEN(RSPI1, SPRI1) = 0;  /* Disable SPRI1 interrupts */
      IR(RSPI1,  SPRI1) = 0;  /* Clear interrupt flag */
      IPR(RSPI1, SPRI1) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI1, SPRI1) = 1;  /* Enable SPRI1 interrupt */
      ICU.IER[0x05].BIT.IEN0 = 1;

      /* Enable error interrupt source bit */

      ICU.GENAL0.BIT.EN19 = 1;

      /* Enable Idle interrupt source bit */

      ICU.GENAL0.BIT.EN18 = 1;
    }
#endif

#ifdef CONFIG_RX65N_RSPI2
  if (bus == RX65N_RSPI_CHANNEL2)
    {
      /* Configure Transmit empty buffer interrupt */

      IEN(RSPI2, SPTI2) = 0;  /* Disable SPTI2 interrupts */
      IR(RSPI2, SPTI2)  = 0;  /* Clear interrupt flag */
      IPR(RSPI2, SPTI2) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI2, SPTI2) = 1;  /* Enable SPTI2 interrupt */
      ICU.IER[13].BIT.IEN5 = 1;

      /* Configure Receive buffer full interrupt */

      IEN(RSPI2, SPRI2) = 0;  /* Disable SPRI2 interrupts */
      IR(RSPI2, SPRI2)  = 0;  /* Clear interrupt flag */
      IPR(RSPI2, SPRI2) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI2, SPRI2) = 1;  /* Enable SPRI2 interrupt */
      ICU.IER[13].BIT.IEN4 = 1;

      /* Enable error interrupt source bit */

      ICU.GENAL0.BIT.EN21 = 1;

      /* Enable Idle interrupt source bit */

      ICU.GENAL0.BIT.EN20 = 1;
    }
#endif
}

/****************************************************************************
 * Function Name: power_on_off
 * Description : Switches power to an RSPI channel.  Required by FIT spec.
 * Arguments :
 *   channel -Which channel to use.
 *   on_or_off -0 means 1 means off
 * Return Value : none
 ****************************************************************************/

static void rspi_power_on_off(uint8_t channel, uint8_t on_or_off)
{
  SYSTEM.PRCR.WORD = 0xa50bu;

  switch (channel)
    {
      case RX65N_RSPI_CHANNEL0:
        MSTP(RSPI0) = on_or_off;
        break;
      case RX65N_RSPI_CHANNEL1:
        MSTP(RSPI1) = on_or_off;
        break;
      case RX65N_RSPI_CHANNEL2:
        MSTP(RSPI2) = on_or_off;
        break;
    }
}

/****************************************************************************
 * Function Name: rspi_reg_protect
 * Description : Register protection enable/disable.  Required by FIT spec.
 * Arguments :
 *   enable - used to enable and disable protection
 * Return Value : none
 ****************************************************************************/

static void rspi_reg_protect(uint8_t enable)
{
  SYSTEM.PRCR.WORD = 0xa50b;
  MPC.PWPR.BIT.B0WI = 0;
  MPC.PWPR.BIT.PFSWE = 1;
}

/****************************************************************************
 * Name: rspi_bus_initialize
 *
 * Description:
 *   Initialize the selected RSPI bus in its default state (Master, 8-bit,
 *   mode 0, etc.)
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_bus_initialize(struct rx65n_rspidev_s *priv)
{
  uint8_t regval8;
  uint16_t regval16;

  /* Initialize control register */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 = regval8 & (~RSPI_SPCR_SMPS); /* RSPI operation (4-wire method) */
  regval8 = regval8 & (~RSPI_SPCR_TXMD); /* Full-duplex synchronous serial communications */
  regval8 = regval8 | (RSPI_SPCR_MSTR);  /* Master mode */
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* RSPI Pin Control Register */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPPCR_OFFSET);
  regval8 &= (~(RSPI_SPPCR_SPLP      /* Loopback mode */
               | RSPI_SPPCR_SPLP2    /* Loopback mode */
               | RSPI_SPPCR_MOIFV    /* MOSI pin idles high */
               | RSPI_SPPCR_MOIFE)); /* MOSI pin idles at MOIFV */
  rspi_putreg8(priv, RX65N_RSPI_SPPCR_OFFSET, regval8);

  /* Sets polarity of SSL signal */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SSLP_OFFSET);
  regval8 &= (~(RSPI_SSLP_SSL0P
                | RSPI_SSLP_SSL1P
                | RSPI_SSLP_SSL2P
                | RSPI_SSLP_SSL3P)); /* RSPCK is low when idle */
  rspi_putreg8(priv, RX65N_RSPI_SSLP_OFFSET, regval8);

  /* Initialize frequency, frame size and SPI mode */

  priv->frequency = 0;
  priv->mode      = SPIDEV_MODE0;

  /* Select a default frequency of approx. 400KHz */

  rspi_setfrequency((struct spi_dev_s *)priv, 400000);

  /* Configure data control register SPDCR
   * Four frames can be transmitted or received in one round of transmission
   * or reception activation.
   */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPDCR_OFFSET);
  regval8 &= (~RSPI_SPDCR_MASK);
#ifdef CONFIG_RX65N_RSPI_BUF_SIZE
  regval8 |= (RSPI_SPDCR_SPFC_MASK & (CONFIG_RX65N_RSPI_BUF_SIZE -1));
  priv->bufsize = CONFIG_RX65N_RSPI_BUF_SIZE;
#else
  regval8 |= (RSPI_SPDCR_SPFC0 | RSPI_SPDCR_SPFC1); /* 4 frames */
  priv->bufsize = BUFSIZE_4FRAME;
#endif
  regval8 |= (RSPI_SPDCR_SPBYT);
  priv->nbits = 8;
  rspi_putreg8(priv, RX65N_RSPI_SPDCR_OFFSET, regval8);

  /*  Configure RSPI clock delay registers SPCKD */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCKD_OFFSET);
  regval8 &= (~RSPI_SPCKD_MASK);
#if CONFIG_RX65N_RSPI_SPCKD_DELAY
  regval8 |= (RSPI_SPCKD_MASK & CONFIG_RX65N_RSPI_SPCKD_DELAY);
#else
  regval8 |= (RSPI_SPCKD_SCKDL1); /* 2RSPCK delay */
#endif
  rspi_putreg8(priv, RX65N_RSPI_SPCKD_OFFSET, regval8);

  /*  Configure RSPI slave select negation delay register SSLND */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SSLND_OFFSET);
  regval8 &= (~RSPI_SSLND_MASK);
#if CONFIG_RX65N_RSPI_SSLND_DELAY
  regval8 |= (RSPI_SSLND_MASK & CONFIG_RX65N_RSPI_SSLND_DELAY);
#else
  regval8 |= (RSPI_SSLND_SLNDL1); /* 2RSPCK delay */
#endif
  rspi_putreg8(priv, RX65N_RSPI_SSLND_OFFSET, regval8);

  /* Configure RSPI next-access delay register SPND  */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPND_OFFSET);
  regval8 &= (~RSPI_SPND_MASK);
#if CONFIG_RX65N_RSPI_SPND_DELAY
  regval8 |= (RSPI_SPND_MASK & CONFIG_RX65N_RSPI_SPND_DELAY);
#else
  regval8 |= (RSPI_SPND_SPNDL1); /* 2RSPCK delay */
#endif
  rspi_putreg8(priv, RX65N_RSPI_SPND_OFFSET, regval8);

  /* Configure RSPI Control Register 2 */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR2_OFFSET);
  regval8 &= (~RSPI_SPCR2_MASK); /* Clear all bit */
#ifdef CONFIG_RX65N_RSPI_HIGHSPEED
  regval8 |= (RSPI_SPCR2_SCKASE);
#endif
  rspi_putreg8(priv, RX65N_RSPI_SPCR2_OFFSET, regval8);

  /* Configure RSPI sequence control register SPSCR */

