apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi_sw.c
  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPSCR_OFFSET);
  regval8 &= (~RSPI_SPSCR_MASK);
  rspi_putreg8(priv, RX65N_RSPI_SPSCR_OFFSET, regval8);

  /* Configure the SPCMD0 command register */

  regval16 = rspi_getreg16(priv, RX65N_RSPI_SPCMD0_OFFSET);
  regval16 &= (~RSPI_SPCMD_MASK);
  regval16 |= ((RSPI_SPCMD_SPB0 | RSPI_SPCMD_SPB1 | RSPI_SPCMD_SPB2)
#if CONFIG_RX65N_RSPI_BITORDER
                | (RSPI_SPCMD_LSBF)     /* RSPI LSB First */
#endif
                | (RSPI_SPCMD_SPNDEN)   /* RSPI Next-Access Delay Enable */
                | (RSPI_SPCMD_SLNDEN)   /* SSL Negation Delay Setting Enable */
                | (RSPI_SPCMD_SCKDEN)); /* RSPCK Delay Setting Enable */
  rspi_putreg16(priv, RX65N_RSPI_SPCMD0_OFFSET, regval16);

  /* Configure Set RSPI data control register 2 (SPDCR2) */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPDCR2_OFFSET);
  regval8 &= (~RSPI_SPDCR2_BYSW);
  rspi_putreg8(priv, RX65N_RSPI_SPDCR2_OFFSET, regval8);

#ifndef CONFIG_SPI_POLLWAIT
  /* Disable all interrupt in SPCR */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 &= ~(RSPI_SPCR_SPEIE     /* RSPI Error Interrupt Enable */
               | RSPI_SPCR_SPTIE   /* Transmit Buffer Empty Interrupt Enable */
               | RSPI_SPCR_SPRIE); /* RSPI Receive Buffer Full Interrupt Enable */
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Disable Idle interrupt in SPCR2 */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR2_OFFSET);
  regval8 &= ~(RSPI_SPCR2_SPIIE); /* RSPI Idle Interrupt Enable */
  rspi_putreg8(priv, RX65N_RSPI_SPCR2_OFFSET, regval8);
#endif

  /* Attach the interrupt */

#ifndef CONFIG_SPI_POLLWAIT
  irq_attach(priv->rspitxirq, (xcpt_t)rspi_txinterrupt, NULL);
  irq_attach(priv->rspirxirq, (xcpt_t)rspi_rxinterrupt, NULL);
  irq_attach(priv->rspierirq, (xcpt_t)rspi_erinterrupt, NULL);
  irq_attach(priv->rspiidlirq, (xcpt_t)rspi_idlinterrupt, NULL);
#endif

  /* Enable RSPI functionality */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 |= (RSPI_SPCR_SPE); /* RSPI Function Enable */
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Enable SPI irq */

#ifndef CONFIG_SPI_POLLWAIT
  up_enable_irq(priv->rspitxirq);
  up_enable_irq(priv->rspirxirq);
  up_enable_irq(priv->rspierirq);
  up_enable_irq(priv->rspiidlirq);
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rx65n_rspibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *rx65n_rspibus_initialize(int bus)
{
  struct rx65n_rspidev_s *priv = NULL;

  irqstate_t flags = enter_critical_section();

#ifdef CONFIG_RX65N_RSPI0
  if (bus == RX65N_RSPI_CHANNEL0)
    {
      /* Select RSPI0 */

      priv = &g_rspi0dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Configure RSPI0 pins for 4WIRE mode
           * RSPCKA,MOSIA, MISOA and SSLA0
           */

          rspi_reg_protect(REG_PROTECTION_OFF); /* Disable protection */
          rspi_pinconfig(bus);

          /* Switches power to an RSPI channel */

          rspi_power_on_off(bus, RSPI_POWER_ON);

          /* Configure interrupt controller for RSPI */

          rspi_interrupt_init(priv, bus);

          /* Set up default configuration: Master, 8-bit, etc. */

          rspi_bus_initialize(priv);

          priv->initialized = true;
        }
    }
  else
#endif
#ifdef CONFIG_RX65N_RSPI1
  if (bus == RX65N_RSPI_CHANNEL1)
    {
      /* Select SPI1 */

      priv = &g_rspi1dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Configure SPI1 pins 4WIRE mode: RSPCKB, MOSIB, MISOB and SSLB0 */

          rspi_reg_protect(REG_PROTECTION_OFF); /* Disable protection */
          rspi_pinconfig(bus);

          /* Switches power to an RSPI channel */

          rspi_power_on_off(bus, RSPI_POWER_ON);

          /* Configure interrupt controller for RSPI */

          rspi_interrupt_init(priv, bus);

          /* Set up default configuration: Master, 8-bit, etc. */

          rspi_bus_initialize(priv);
          priv->initialized = true;
        }
    }
  else
#endif
#ifdef CONFIG_RX65N_RSPI2
  if (bus == RX65N_RSPI_CHANNEL2)
    {
      /* Select SPI2 */

      priv = &g_rspi2dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Configure SPI2 pins 4WIRE mode: RSPCKC, MOSIC, MISOC and SSLC0 */

          rspi_reg_protect(REG_PROTECTION_OFF); /* Disable protection */
          rspi_pinconfig(bus);

          /* Switches power to an RSPI channel */

          rspi_power_on_off(bus, RSPI_POWER_ON);

          /* Configure interrupt controller for RSPI */

          rspi_interrupt_init(priv, bus);

          /* Set up default configuration: Master, 8-bit, etc. */

          rspi_bus_initialize(priv);

          priv->initialized = true;
        }
    }
  else
#endif
    {
      spierr("ERROR: Unsupported RSPI bus: %d\n", bus);
    }

  leave_critical_section(flags);
  return (struct spi_dev_s *)priv;
}

#endif /* CONFIG_RX65N_RSPI0 || CONFIG_RX65N_RSPI1 || CONFIG_RX65N_RSPI2 */
